RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S16/LPC55S16/LPC55S16.h
#define PUF_IDXBLK_STATUS_IDX7_MASK              (0xC000U)
#define PUF_IDXBLK_STATUS_IDX7_SHIFT             (14U)
/*! IDX7 - Status block index 7
 */
#define PUF_IDXBLK_STATUS_IDX7(x)                (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDX7_SHIFT)) & PUF_IDXBLK_STATUS_IDX7_MASK)

#define PUF_IDXBLK_STATUS_IDX8_MASK              (0x30000U)
#define PUF_IDXBLK_STATUS_IDX8_SHIFT             (16U)
/*! IDX8 - Status block index 8
 */
#define PUF_IDXBLK_STATUS_IDX8(x)                (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDX8_SHIFT)) & PUF_IDXBLK_STATUS_IDX8_MASK)

#define PUF_IDXBLK_STATUS_IDX9_MASK              (0xC0000U)
#define PUF_IDXBLK_STATUS_IDX9_SHIFT             (18U)
/*! IDX9 - Status block index 9
 */
#define PUF_IDXBLK_STATUS_IDX9(x)                (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDX9_SHIFT)) & PUF_IDXBLK_STATUS_IDX9_MASK)

#define PUF_IDXBLK_STATUS_IDX10_MASK             (0x300000U)
#define PUF_IDXBLK_STATUS_IDX10_SHIFT            (20U)
/*! IDX10 - Status block index 10
 */
#define PUF_IDXBLK_STATUS_IDX10(x)               (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDX10_SHIFT)) & PUF_IDXBLK_STATUS_IDX10_MASK)

#define PUF_IDXBLK_STATUS_IDX11_MASK             (0xC00000U)
#define PUF_IDXBLK_STATUS_IDX11_SHIFT            (22U)
/*! IDX11 - Status block index 11
 */
#define PUF_IDXBLK_STATUS_IDX11(x)               (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDX11_SHIFT)) & PUF_IDXBLK_STATUS_IDX11_MASK)

#define PUF_IDXBLK_STATUS_IDX12_MASK             (0x3000000U)
#define PUF_IDXBLK_STATUS_IDX12_SHIFT            (24U)
/*! IDX12 - Status block index 12
 */
#define PUF_IDXBLK_STATUS_IDX12(x)               (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDX12_SHIFT)) & PUF_IDXBLK_STATUS_IDX12_MASK)

#define PUF_IDXBLK_STATUS_IDX13_MASK             (0xC000000U)
#define PUF_IDXBLK_STATUS_IDX13_SHIFT            (26U)
/*! IDX13 - Status block index 13
 */
#define PUF_IDXBLK_STATUS_IDX13(x)               (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDX13_SHIFT)) & PUF_IDXBLK_STATUS_IDX13_MASK)

#define PUF_IDXBLK_STATUS_IDX14_MASK             (0x30000000U)
#define PUF_IDXBLK_STATUS_IDX14_SHIFT            (28U)
/*! IDX14 - Status block index 14
 */
#define PUF_IDXBLK_STATUS_IDX14(x)               (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDX14_SHIFT)) & PUF_IDXBLK_STATUS_IDX14_MASK)

#define PUF_IDXBLK_STATUS_IDX15_MASK             (0xC0000000U)
#define PUF_IDXBLK_STATUS_IDX15_SHIFT            (30U)
/*! IDX15 - Status block index 15
 */
#define PUF_IDXBLK_STATUS_IDX15(x)               (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDX15_SHIFT)) & PUF_IDXBLK_STATUS_IDX15_MASK)
/*! @} */

/*! @name SHIFT_STATUS -  */
/*! @{ */

#define PUF_SHIFT_STATUS_KEY0_MASK               (0xFU)
#define PUF_SHIFT_STATUS_KEY0_SHIFT              (0U)
/*! KEY0 - Index counter from key 0 shift register
 */
#define PUF_SHIFT_STATUS_KEY0(x)                 (((uint32_t)(((uint32_t)(x)) << PUF_SHIFT_STATUS_KEY0_SHIFT)) & PUF_SHIFT_STATUS_KEY0_MASK)

#define PUF_SHIFT_STATUS_KEY1_MASK               (0xF0U)
#define PUF_SHIFT_STATUS_KEY1_SHIFT              (4U)
/*! KEY1 - Index counter from key 1 shift register
 */
#define PUF_SHIFT_STATUS_KEY1(x)                 (((uint32_t)(((uint32_t)(x)) << PUF_SHIFT_STATUS_KEY1_SHIFT)) & PUF_SHIFT_STATUS_KEY1_MASK)

#define PUF_SHIFT_STATUS_KEY2_MASK               (0xF00U)
#define PUF_SHIFT_STATUS_KEY2_SHIFT              (8U)
/*! KEY2 - Index counter from key 2 shift register
 */
#define PUF_SHIFT_STATUS_KEY2(x)                 (((uint32_t)(((uint32_t)(x)) << PUF_SHIFT_STATUS_KEY2_SHIFT)) & PUF_SHIFT_STATUS_KEY2_MASK)

#define PUF_SHIFT_STATUS_KEY3_MASK               (0xF000U)
#define PUF_SHIFT_STATUS_KEY3_SHIFT              (12U)
/*! KEY3 - Index counter from key 3 shift register
 */
#define PUF_SHIFT_STATUS_KEY3(x)                 (((uint32_t)(((uint32_t)(x)) << PUF_SHIFT_STATUS_KEY3_SHIFT)) & PUF_SHIFT_STATUS_KEY3_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group PUF_Register_Masks */


/* PUF - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral PUF base address */
  #define PUF_BASE                                 (0x5003B000u)
  /** Peripheral PUF base address */
  #define PUF_BASE_NS                              (0x4003B000u)
  /** Peripheral PUF base pointer */
  #define PUF                                      ((PUF_Type *)PUF_BASE)
  /** Peripheral PUF base pointer */
  #define PUF_NS                                   ((PUF_Type *)PUF_BASE_NS)
  /** Array initializer of PUF peripheral base addresses */
  #define PUF_BASE_ADDRS                           { PUF_BASE }
  /** Array initializer of PUF peripheral base pointers */
  #define PUF_BASE_PTRS                            { PUF }
  /** Array initializer of PUF peripheral base addresses */
  #define PUF_BASE_ADDRS_NS                        { PUF_BASE_NS }
  /** Array initializer of PUF peripheral base pointers */
  #define PUF_BASE_PTRS_NS                         { PUF_NS }
#else
  /** Peripheral PUF base address */
  #define PUF_BASE                                 (0x4003B000u)
  /** Peripheral PUF base pointer */
  #define PUF                                      ((PUF_Type *)PUF_BASE)
  /** Array initializer of PUF peripheral base addresses */
  #define PUF_BASE_ADDRS                           { PUF_BASE }
  /** Array initializer of PUF peripheral base pointers */
  #define PUF_BASE_PTRS                            { PUF }
#endif
/** Interrupt vectors for the PUF peripheral type */
#define PUF_IRQS                                 { PUF_IRQn }

/*!
 * @}
 */ /* end of group PUF_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- PUF_SRAM_CTRL Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PUF_SRAM_CTRL_Peripheral_Access_Layer PUF_SRAM_CTRL Peripheral Access Layer
 * @{
 */

/** PUF_SRAM_CTRL - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[768];
  __IO uint32_t CFG;                               /**< Configuration Register, offset: 0x300 */
  __I  uint32_t STATUS;                            /**< Status Register, offset: 0x304 */
       uint8_t RESERVED_1[208];
  __O  uint32_t INT_CLR_ENABLE;                    /**< Interrupt Enable Clear Register, offset: 0x3D8 */
  __O  uint32_t INT_SET_ENABLE;                    /**< Interrupt Enable Set Register, offset: 0x3DC */
  __I  uint32_t INT_STATUS;                        /**< Interrupt Status Register, offset: 0x3E0 */
  __I  uint32_t INT_ENABLE;                        /**< Interrupt Enable Register, offset: 0x3E4 */
  __O  uint32_t INT_CLR_STATUS;                    /**< Interrupt Status Clear Register, offset: 0x3E8 */
  __O  uint32_t INT_SET_STATUS;                    /**< Interrupt Status set, offset: 0x3EC */
} PUF_SRAM_CTRL_Type;

/* ----------------------------------------------------------------------------
   -- PUF_SRAM_CTRL Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PUF_SRAM_CTRL_Register_Masks PUF_SRAM_CTRL Register Masks
 * @{
 */

/*! @name CFG - Configuration Register */
/*! @{ */

#define PUF_SRAM_CTRL_CFG_ENABLE_MASK            (0x1U)
#define PUF_SRAM_CTRL_CFG_ENABLE_SHIFT           (0U)
/*! enable - PUF SRAM Controller activation
 */
#define PUF_SRAM_CTRL_CFG_ENABLE(x)              (((uint32_t)(((uint32_t)(x)) << PUF_SRAM_CTRL_CFG_ENABLE_SHIFT)) & PUF_SRAM_CTRL_CFG_ENABLE_MASK)

#define PUF_SRAM_CTRL_CFG_CKGATING_MASK          (0x4U)
#define PUF_SRAM_CTRL_CFG_CKGATING_SHIFT         (2U)
/*! ckgating - PUF SRAM Clock Gating control
 */
#define PUF_SRAM_CTRL_CFG_CKGATING(x)            (((uint32_t)(((uint32_t)(x)) << PUF_SRAM_CTRL_CFG_CKGATING_SHIFT)) & PUF_SRAM_CTRL_CFG_CKGATING_MASK)
/*! @} */

/*! @name STATUS - Status Register */
/*! @{ */

